ezois_ka/oooezoiskaobmen/src/DataProcessors/ПроведениеДокументовПоВидамУчета/ПроведениеДокументовПоВидамУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроведениеДокументовПоВидамУчета</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетСреднегоЗаработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетСтраховыхВзносов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/НачисленияУдержанияПоСотрудникам/НачисленияУдержанияПоСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачисленияУдержанияПоСотрудникам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГруппаНачисленияУдержанияВыплаты</name>
    <type>
      <types>EnumRef.ГруппыНачисленияУдержанияВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияВыполненияРаботВОрганизации</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <comment>Для строк НДФЛ</comment>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВзыскания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРаспределенииНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДохода</name>
    <comment>Для строк НДФЛ</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДохода</name>
    <comment>АПК:58 имя ВидДохода уже занято</comment>
    <type>
      <types>EnumRef.КатегорииДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПолученияДохода</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаИсполнительногоПроизводства</name>
    <type>
      <types>EnumRef.ВидыДоходовИсполнительногоПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетАвансаНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DefinedType.СторнируемыйДокумент</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачислениеУдержание</name>
    <type>
      <types>EnumRef.ВидыВзаиморасчетовССотрудниками</types>
      <types>EnumRef.ВидыОсобыхНачисленийИУдержаний</types>
      <types>ChartOfCalculationTypesRef.Начисления</types>
      <types>ChartOfCalculationTypesRef.Удержания</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen/src/AccumulationRegisters/СведенияОДоходахСтраховыеВзносы/СведенияОДоходахСтраховыеВзносы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СведенияОДоходахСтраховыеВзносы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.ВидыВыплатБывшимСотрудникам</types>
      <types>CatalogRef.ВидыПрочихДоходовФизическихЛиц</types>
      <types>EnumRef.ВидыОсобыхНачисленийИУдержаний</types>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДохода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоАктуПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБюджетныйТарифНСиПЗ</name>
    <comment>АПК:58</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЯвляетсяДоходомФармацевта</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяВзносамиНаДоплатуЛетчикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяВзносамиНаДоплатуШахтерам</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
    <type>
      <types>EnumRef.ВидыРаботСДосрочнойПенсией</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассУсловийТруда</name>
    <type>
      <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛьготныйТерриториальныйТариф</name>
    <type>
      <types>CatalogRef.ВидыТарифовСтраховыхВзносов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидДохода</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen/src/Enums/ВидыОсобыхНачисленийИУдержаний/ВидыОсобыхНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОсобыхНачисленийИУдержаний</name>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ДоговорАвторскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ДоговорРаботыУслуги</name>
  </enumValues>
  <enumValues>
    <name>ДСВРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаЗадержкуЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяВыгодаПоЗаймам</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>НачисленоПроцентовПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛЗачтено</name>
  </enumValues>
  <enumValues>
    <name>НДФЛКЗачету</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛРасчетыСБывшимиСотрудниками</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаИзЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьПодарковПризов</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребение</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребениеСотруднику</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышенияПоСтавке18</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышенияПоСтавке20</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышенияПоСтавке22</name>
  </enumValues>
  <enumValues>
    <name>НДФЛКЗачетуРКСН</name>
  </enumValues>
  <enumValues>
    <name>НДФЛЗачтеноРКСН</name>
  </enumValues>
  <enumValues>
    <name>ДополнительнаяОблагаемаяБазаРуководителя</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/DataProcessors/ПроведениеДокументовПоВидамУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыПроведенияПоУчетам() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВидыУчета", "");
	Результат.Вставить("Организация", Неопределено);
	Результат.Вставить("Период", Новый СтандартныйПериод());
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПровестиДокументыПоУчетам(Параметры) Экспорт
	
	ВидыУчета = Параметры.ВидыУчета;
	
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Подготовка'"), 0);
	
	МассивДокументов = Неопределено;
	Если Не Параметры.Свойство("ДокументыДляОбработки", МассивДокументов) Тогда
		МассивДокументов = МассивДокументов(Параметры, ВидыУчета);
	КонецЕсли;
	ПропущенныеДокументы = Новый Массив;
	
	ВсегоДокументов = МассивДокументов.Количество();
	Обработано = 0;
	ПредыдущийПрогресс = 0;
	НачальноеВремя = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для Каждого Документ Из МассивДокументов Цикл
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПереносДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		Отказ = Ложь;
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ);
		
		Попытка
			МенеджерДокумента.ПровестиПоУчетам(Документ, РежимПроведенияДокумента.Неоперативный, Отказ, ВидыУчета);
		Исключение
			Информация = ИнформацияОбОшибке();
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю(Строка(Документ) + " - " +  Информация.Описание, Документ);
			ПропущенныеДокументы.Добавить(Документ);
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
		Обработано = Обработано + 1;
		Прогресс = Окр(Обработано*100/ВсегоДокументов, 0);
		Если Прогресс <> ПредыдущийПрогресс Тогда
			
 			ВремяНаПроцент = (ТекущаяУниверсальнаяДатаВМиллисекундах() - НачальноеВремя) / Прогресс;
			ПредыдущийПрогресс = Прогресс;
			ВремяПрогноз = (ВремяНаПроцент * (100 - Прогресс)) / 1000;
			
			ДлительныеОперации.СообщитьПрогресс(Прогресс, СтрШаблон(НСтр("ru = 'Обработано %1 из %2'"), Обработано, ВсегоДокументов), ВремяПрогноз);
		КонецЕсли;
	 	
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ПропущенныеДокументы", ПропущенныеДокументы);
	
	Возврат Результат;
	                                               	
КонецФункции

Функция МассивДокументов(Параметры, ВидыУчета)
	
	ТекстыЗапросов = Новый Массив;	
	Запрос = Новый Запрос;
	
	МассивВидовУчета = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВидыУчета);	
	Для Каждого ВидУчета Из МассивВидовУчета Цикл
		
		Если ВидУчета = ИмяВидаУчетаСреднегоЗаработка() Тогда
			
			ТекстЗапроса = ТекстЗапросаДокументыДанныеДляРасчетаСреднего(Параметры);
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			Запрос.УстановитьПараметр("Значение", Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать);
			Запрос.УстановитьПараметр("ЗначениеФСС", Перечисления.УчетНачисленийВСреднемЗаработкеФСС.НеВключать);
			
		КонецЕсли;
		
		Если ВидУчета = ИмяВидаУчетаСтраховыхВзносов() Тогда
			
			ТекстЗапроса = ТекстЗапросаДокументыСтраховыеВзносы(Параметры);
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов());
	ТекстЗапросаПоВТУчетов = ТекстЗапросаПоВТУчетов(МассивВидовУчета);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(ТекстЗапроса, ТекстЗапросаПоВТУчетов);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", Параметры.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Параметры.Период.ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
		
КонецФункции

Функция ТекстЗапросаДокументыДанныеДляРасчетаСреднего(Параметры)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НачисленияСреднийЗаработокОбщий.Ссылка КАК Начисление
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	ПланВидовРасчета.Начисления.СреднийЗаработокОбщий КАК НачисленияСреднийЗаработокОбщий
	|ГДЕ
	|	НачисленияСреднийЗаработокОбщий.Значение <> &Значение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленияСреднийЗаработокФСС.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления.СреднийЗаработокФСС КАК НачисленияСреднийЗаработокФСС
	|ГДЕ
	|	НачисленияСреднийЗаработокФСС.Значение <> &ЗначениеФСС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Начисления.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТ_НачисленияБезДублей
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТРегистраторы_ДанныеДляРасчетаСреднего
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Организация
	|				И НачислениеУдержание В
	|					(ВЫБРАТЬ
	|						ВТ_НачисленияБезДублей.Начисление
	|					ИЗ
	|						ВТ_НачисленияБезДублей КАК ВТ_НачисленияБезДублей)) КАК НачисленияУдержанияПоСотрудникамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Регистратор
	|ИЗ
	|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий
	|ГДЕ
	|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация = &Организация
	|	И ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор
	|ИЗ
	|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС
	|ГДЕ
	|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор.Организация = &Организация
	|	И ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор.Организация = &Организация", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация = &Организация", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "ИСТИНА");
	КонецЕсли;
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДокументыСтраховыеВзносы(Параметры)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СведенияОДоходахСтраховыеВзносы.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТРегистраторы_СтраховыеВзносы
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
	|ГДЕ
	|	СведенияОДоходахСтраховыеВзносы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И СведенияОДоходахСтраховыеВзносы.Организация = &Организация";
		
	Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СведенияОДоходахСтраховыеВзносы.Организация = &Организация", "ИСТИНА");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоВТУчетов(ВидыУчета)
	
	ШаблонТекста = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВидУчета.Регистратор КАК Регистратор
	               |ИЗ
	               |	ВТРегистраторы_ВидУчета КАК ВидУчета";
	
	ЧастиЗапроса = Новый Массив;
	УдалятьПсевдоним = Ложь;
	
	Для Каждого ВидУчета Из ВидыУчета Цикл
		
		ТекстЗапроса = ШаблонТекста;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВидУчета", ВидУчета);
		Если УдалятьПсевдоним Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КАК Регистратор", "");
		КонецЕсли;
		ЧастиЗапроса.Добавить(ТекстЗапроса);
		
		УдалятьПсевдоним = Истина;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИмяВидаУчетаСтраховыхВзносов() Экспорт
	
	Возврат "СтраховыеВзносы";
	
КонецФункции

Функция ИмяВидаУчетаСреднегоЗаработка() Экспорт

	Возврат "ДанныеДляРасчетаСреднего";
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
